zephyrproject-rtos/zephyr/drivers/i2c/i2c_stm32_v2_rtio.c
/*
 * Copyright (c) 2016 BayLibre, SAS
 * Copyright (c) 2017 Linaro Ltd
 * Copyright (c) 2024 Intel Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/cache.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/i2c/rtio.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/sys/util.h>

#include <soc.h>
#include <stm32_cache.h>
#include <stm32_ll_i2c.h>
#include <stm32_ll_rcc.h>

#include <errno.h>

#include "i2c_stm32.h"
#include "i2c-priv.h"

LOG_MODULE_REGISTER(i2c_ll_stm32_v2_rtio, CONFIG_I2C_LOG_LEVEL);

#if CONFIG_STM32_HAL2
#define STM32_I2C_CONVERT_TIMINGS(prescaler, setup_time, hold_time, sclh_period, scll_period) \
	LL_I2C_CONVERT_TIMINGS(prescaler, setup_time, hold_time, sclh_period, scll_period)
#else /* CONFIG_STM32_HAL2 */
#define STM32_I2C_CONVERT_TIMINGS(prescaler, setup_time, hold_time, sclh_period, scll_period) \
	__LL_I2C_CONVERT_TIMINGS(prescaler, setup_time, hold_time, sclh_period, scll_period)
#endif /* CONFIG_STM32_HAL2 */

#ifdef CONFIG_I2C_STM32_V2_DMA
static bool using_dma(struct i2c_stm32_data *dev_data)
{
	return dev_data->use_dma;
}

static int configure_start_dma(struct stream const *dma, struct dma_config *dma_cfg,
			       struct dma_block_config *blk_cfg)
{
	if (!device_is_ready(dma->dev_dma)) {
		LOG_ERR("DMA device not ready");
		return -ENODEV;
	}

	dma_cfg->head_block = blk_cfg;
	dma_cfg->block_count = 1;

	int ret = dma_config(dma->dev_dma, dma->dma_channel, dma_cfg);

	if (ret != 0) {
		LOG_ERR("Problem setting up DMA: %d", ret);
		return ret;
	}

	ret = dma_start(dma->dev_dma, dma->dma_channel);
	if (ret != 0) {
		LOG_ERR("Problem starting DMA: %d", ret);
		return ret;
	}

	return 0;
}

static int dma_xfer_start(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	int ret;

	if ((data->xfer_flags & I2C_MSG_READ) != 0U) {
		/* Save DMA receive buffer to later invalidate cache before reading received data */
		data->dma_buf = data->xfer_buf;
		data->dma_len = data->xfer_len;

		data->dma_blk_cfg.source_address = LL_I2C_DMA_GetRegAddr(
			cfg->i2c, LL_I2C_DMA_REG_DATA_RECEIVE);
		data->dma_blk_cfg.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		data->dma_blk_cfg.dest_address = (uint32_t)data->xfer_buf;
		data->dma_blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		data->dma_blk_cfg.block_size = data->xfer_len;

		ret = configure_start_dma(&cfg->rx_dma, &data->dma_rx_cfg, &data->dma_blk_cfg);
		if (ret != 0) {
			return ret;
		}

		LL_I2C_EnableDMAReq_RX(i2c);
	} else {
		data->dma_blk_cfg.source_address = (uint32_t)data->xfer_buf;
		data->dma_blk_cfg.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		data->dma_blk_cfg.dest_address = LL_I2C_DMA_GetRegAddr(
			cfg->i2c, LL_I2C_DMA_REG_DATA_TRANSMIT);
		data->dma_blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		data->dma_blk_cfg.block_size = data->xfer_len;

		ret = configure_start_dma(&cfg->tx_dma, &data->dma_tx_cfg, &data->dma_blk_cfg);
		if (ret != 0) {
			return ret;
		}

		LL_I2C_EnableDMAReq_TX(i2c);
	}

	return 0;
}

static void dma_finish(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;

	if ((data->xfer_flags & I2C_MSG_READ) != 0U) {
		dma_stop(cfg->rx_dma.dev_dma, cfg->rx_dma.dma_channel);
		LL_I2C_DisableDMAReq_RX(cfg->i2c);

		if ((data->dma_len != 0U) &&
		    !stm32_buf_in_nocache((uintptr_t)data->dma_buf, data->dma_len)) {
			sys_cache_data_invd_range(data->dma_buf, data->dma_len);
		}
	} else {
		dma_stop(cfg->tx_dma.dev_dma, cfg->tx_dma.dma_channel);
		LL_I2C_DisableDMAReq_TX(cfg->i2c);
	}
}
#else /* CONFIG_I2C_STM32_V2_DMA */
static bool using_dma(struct i2c_stm32_data *data __unused)
{
	return false;
}
static int dma_xfer_start(const struct device *dev __unused)
{
	return 0;
}
static void dma_finish(const struct device *dev __unused)
{
}
#endif /* CONFIG_I2C_STM32_V2_DMA */

static void i2c_stm32_disable_transfer_interrupts(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	I2C_TypeDef *i2c = cfg->i2c;

	LL_I2C_DisableIT_TX(i2c);
	LL_I2C_DisableIT_RX(i2c);
	LL_I2C_DisableIT_STOP(i2c);
	LL_I2C_DisableIT_NACK(i2c);
	LL_I2C_DisableIT_TC(i2c);
	LL_I2C_DisableIT_ERR(i2c);
}

static void i2c_stm32_enable_transfer_interrupts(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	I2C_TypeDef *i2c = cfg->i2c;

	LL_I2C_EnableIT_STOP(i2c);
	LL_I2C_EnableIT_NACK(i2c);
	LL_I2C_EnableIT_TC(i2c);
	LL_I2C_EnableIT_ERR(i2c);
}

static void i2c_stm32_controller_mode_end(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;

	if (using_dma(data)) {
		dma_finish(dev);
	}

	i2c_stm32_disable_transfer_interrupts(dev);

	if (LL_I2C_IsEnabledReloadMode(i2c)) {
		LL_I2C_DisableReloadMode(i2c);
	}

#if defined(CONFIG_I2C_TARGET)
	data->controller_active = false;
	if (!data->target_attached) {
		LL_I2C_Disable(i2c);
	}
#else
	LL_I2C_Disable(i2c);
#endif

}

#if defined(CONFIG_I2C_TARGET)
static void i2c_stm32_target_event(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	const struct i2c_target_callbacks *target_cb;
	struct i2c_target_config *target_cfg = NULL;

	if (data->target_cfg != NULL) {
		/**
		 * Target1 is configured and could be in 7- or 10-bit mode.
		 * If 10-bit mode is enabled, Target2 cannot be in use because
		 * it only supports 7-bit mode, so we know which cfg is matched.
		 * If 7-bit mode is enabled, find the correct cfg based on
		 * the I2C address sent by bus controller.
		 */
		if ((data->target_cfg->flags & I2C_TARGET_FLAGS_ADDR_10_BITS) != 0) {
			target_cfg = data->target_cfg;
		} else {
			uint8_t target_address;

			/* Choose the right target from the address match code */
			target_address = LL_I2C_GetAddressMatchCode(i2c) >> 1;
			if (target_address == data->target_cfg->address) {
				target_cfg = data->target_cfg;
			} else if (data->target2_cfg != NULL &&
				   target_address == data->target2_cfg->address) {
				target_cfg = data->target2_cfg;
			}
		}

	} else {
		/**
		 * If we received an event but Target1 is not configured,
		 * then Target2 should be the target for the event.
		 */
		target_cfg = data->target2_cfg;
	}

	if (target_cfg == NULL) {
		__ASSERT_NO_MSG(0);
		return;
	}

	target_cb = target_cfg->callbacks;

	if (LL_I2C_IsActiveFlag_TXIS(i2c)) {
		uint8_t val = 0x00;
		int ret = target_cb->read_processed(target_cfg, &val);

		/* We should transmit the data before logging because logging could
		 * lead the i2c target to stretch the clock if the data are not
		 * transmitted fast enough.
		 */
		LL_I2C_TransmitData8(i2c, val);
		if (ret < 0) {
			LOG_ERR("Error continuing reading");
		}

		return;
	}

	if (LL_I2C_IsActiveFlag_RXNE(i2c)) {
		uint8_t val = LL_I2C_ReceiveData8(i2c);

		if (target_cb->write_received(target_cfg, val)) {
			LL_I2C_AcknowledgeNextData(i2c, LL_I2C_NACK);
		}
		return;
	}

	if (LL_I2C_IsActiveFlag_NACK(i2c)) {
		LL_I2C_ClearFlag_NACK(i2c);
	}

	if (LL_I2C_IsActiveFlag_STOP(i2c)) {
		i2c_stm32_disable_transfer_interrupts(dev);

		/* Flush remaining TX byte before clearing Stop Flag */
		LL_I2C_ClearFlag_TXE(i2c);

		LL_I2C_ClearFlag_STOP(i2c);

		target_cb->stop(target_cfg);

		/* Prepare to ACK next transmissions address byte */
		LL_I2C_AcknowledgeNextData(i2c, LL_I2C_ACK);
	}

	if (LL_I2C_IsActiveFlag_ADDR(i2c)) {
		uint32_t dir;

		LL_I2C_ClearFlag_ADDR(i2c);

		dir = LL_I2C_GetTransferDirection(i2c);
		if (dir == LL_I2C_DIRECTION_WRITE) {
			if (target_cb->write_requested(target_cfg) < 0) {
				LOG_ERR("Error initiating writing");
			} else {
				LL_I2C_EnableIT_RX(i2c);
			}
		} else {
			uint8_t val;

			if (target_cb->read_requested(target_cfg, &val) < 0) {
				LOG_ERR("Error initiating reading");
			} else {
				LL_I2C_TransmitData8(i2c, val);
				LL_I2C_EnableIT_TX(i2c);
			}
		}

		i2c_stm32_enable_transfer_interrupts(dev);
	}
}

/* Attach and start I2C as target */
int i2c_stm32_target_register(const struct device *dev,
			      struct i2c_target_config *config)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	uint32_t bitrate_cfg;
	int ret;

	if (config == NULL) {
		return -EINVAL;
	}

	if (data->target_cfg && data->target2_cfg) {
		return -EBUSY;
	}

	if (data->controller_active) {
		return -EBUSY;
	}

	bitrate_cfg = i2c_map_dt_bitrate(cfg->bitrate);

	ret = i2c_stm32_runtime_configure(dev, bitrate_cfg);
	if (ret < 0) {
		LOG_ERR("i2c: failure initializing");
		return ret;
	}

	/* Mark device as active */
	ret = pm_device_runtime_get(dev);
	if (ret < 0) {
		LOG_ERR_PM_DEVICE_RUNTIME_GET(dev, ret);
		return ret;
	}

#if defined(I2C_CR1_WUPEN)
	if (pm_device_wakeup_is_capable(dev)) {
		/* Enable wake-up from stop */
		LOG_DBG("i2c: enabling wakeup from stop");
		LL_I2C_EnableWakeUpFromStop(cfg->i2c);
	}
#endif /* I2C_CR1_WUPEN */

	LL_I2C_Enable(i2c);

	if (!data->target_cfg) {
		data->target_cfg = config;
		if ((data->target_cfg->flags & I2C_TARGET_FLAGS_ADDR_10_BITS) != 0) {
			LL_I2C_SetOwnAddress1(i2c, config->address, LL_I2C_OWNADDRESS1_10BIT);
			LOG_DBG("i2c: target #1 registered with 10-bit address");
		} else {
			LL_I2C_SetOwnAddress1(i2c, config->address << 1U, LL_I2C_OWNADDRESS1_7BIT);
			LOG_DBG("i2c: target #1 registered with 7-bit address");
		}

		LL_I2C_EnableOwnAddress1(i2c);

		LOG_DBG("i2c: target #1 registered");
	} else {
		if ((config->flags & I2C_TARGET_FLAGS_ADDR_10_BITS) != 0) {
			(void)pm_device_runtime_put(dev);
			return -EINVAL;
		}

		data->target2_cfg = config;

		LL_I2C_SetOwnAddress2(i2c, config->address << 1U,
				      LL_I2C_OWNADDRESS2_NOMASK);
		LL_I2C_EnableOwnAddress2(i2c);
		LOG_DBG("i2c: target #2 registered");
	}

	data->target_attached = true;

	LL_I2C_EnableIT_ADDR(i2c);

	return 0;
}

int i2c_stm32_target_unregister(const struct device *dev,
				struct i2c_target_config *config)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;

	if (!data->target_attached) {
		return -EINVAL;
	}

	if (data->controller_active) {
		return -EBUSY;
	}

	if (config == data->target_cfg) {
		LL_I2C_DisableOwnAddress1(i2c);
		data->target_cfg = NULL;

		LOG_DBG("i2c: target #1 unregistered");
	} else if (config == data->target2_cfg) {
		LL_I2C_DisableOwnAddress2(i2c);
		data->target2_cfg = NULL;

		LOG_DBG("i2c: target #2 unregistered");
	} else {
		return -EINVAL;
	}

	/* Return if there is a target remaining */
	if (data->target_cfg || data->target2_cfg) {
		(void)pm_device_runtime_put(dev);
		LOG_DBG("i2c: target#%c still registered", data->target_cfg ? '1' : '2');
		return 0;
	}

	/* Otherwise disable I2C */
	LL_I2C_DisableIT_ADDR(i2c);
	i2c_stm32_disable_transfer_interrupts(dev);

	LL_I2C_ClearFlag_NACK(i2c);
	LL_I2C_ClearFlag_STOP(i2c);
	LL_I2C_ClearFlag_ADDR(i2c);

	LL_I2C_Disable(i2c);

#if defined(I2C_CR1_WUPEN)
	if (pm_device_wakeup_is_capable(dev)) {
		/* Disable wake-up from STOP */
		LOG_DBG("i2c: disabling wakeup from stop");
		LL_I2C_DisableWakeUpFromStop(i2c);
	}
#endif /* I2C_CR1_WUPEN */

	/* Release the device */
	(void)pm_device_runtime_put(dev);

	data->target_attached = false;

	return 0;
}

#endif /* defined(CONFIG_I2C_TARGET) */

static void i2c_stm32_reload_burst(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;

	__ASSERT_NO_MSG(LL_I2C_IsEnabledReloadMode(i2c));

	if (data->xfer_len > UINT8_MAX) {
		/* Not the last burst for this message, don't consider STOP and RESTART flags */
		data->burst_len = UINT8_MAX;
		data->burst_flags = data->xfer_flags & ~(I2C_MSG_STOP | I2C_MSG_RESTART);
	} else {
		/* Preserve possible STOP flag */
		data->burst_len = data->xfer_len;
		data->burst_flags = data->xfer_flags;
	}

	LL_I2C_SetTransferSize(i2c, data->burst_len);

	/* If last burst in reload mode, disable the mode now that transfer size is loaded */
	if ((data->burst_len == data->xfer_len) &&
	    (data->burst_flags & I2C_MSG_STM32_USE_RELOAD_MODE) == 0) {
		LL_I2C_DisableReloadMode(i2c);
	}
}

void i2c_stm32_event(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	int ret = 0;

#if defined(CONFIG_I2C_TARGET)
	if (data->target_attached && !data->controller_active) {
		i2c_stm32_target_event(dev);
		return;
	}
#endif

	if (!using_dma(data) && (data->burst_len != 0U)) {
		if (LL_I2C_IsActiveFlag_TXIS(i2c)) {
			/* Send next byte */
			LL_I2C_TransmitData8(i2c, *data->xfer_buf);
			data->xfer_buf++;
			data->xfer_len--;
			data->burst_len--;
		} else if (LL_I2C_IsActiveFlag_RXNE(i2c)) {
			/* Receive next byte */
			*data->xfer_buf = LL_I2C_ReceiveData8(i2c);
			data->xfer_buf++;
			data->xfer_len--;
			data->burst_len--;
		}
	}

	/* NACK received */
	if (LL_I2C_IsActiveFlag_NACK(i2c)) {
		LL_I2C_ClearFlag_NACK(i2c);
		/*
		 * AutoEndMode is always disabled in controller mode,
		 * so send a stop condition manually
		 */
		LL_I2C_GenerateStopCondition(i2c);
		ret = -EIO;
	}

	/* STOP received */
	if (LL_I2C_IsActiveFlag_STOP(i2c)) {
		LL_I2C_ClearFlag_STOP(i2c);
		LL_I2C_DisableReloadMode(i2c);
		i2c_stm32_controller_mode_end(dev);

		i2c_stm32_rtio_complete(dev, ret);
		return;
	}

	if (LL_I2C_IsEnabledIT_TC(i2c) &&
	    (LL_I2C_IsActiveFlag_TC(i2c) || LL_I2C_IsActiveFlag_TCR(i2c))) {
		if (using_dma(data) && (data->burst_len != 0U)) {
			data->xfer_len -= data->burst_len;
			data->xfer_buf += data->burst_len;
			data->burst_len = 0U;
		}

		__ASSERT_NO_MSG(data->burst_len == 0U);

		if (data->xfer_len != 0U) {
			i2c_stm32_reload_burst(dev);
			return;
		}

		/* Issue stop condition if necessary */
		if ((data->burst_flags & I2C_MSG_STOP) != 0) {
			LL_I2C_GenerateStopCondition(i2c);
		} else {
			if (using_dma(data)) {
				dma_finish(dev);
			}

			i2c_stm32_disable_transfer_interrupts(dev);
			i2c_stm32_rtio_complete(dev, ret);
		}
	}
}

int i2c_stm32_error(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	I2C_TypeDef *i2c = cfg->i2c;
	int ret = 0;

#if defined(CONFIG_I2C_TARGET)
	struct i2c_stm32_data *data = dev->data;
	i2c_target_error_cb_t error_cb = NULL;

	if (data->target_attached && !data->controller_active &&
	    data->target_cfg != NULL && data->target_cfg->callbacks != NULL) {
		error_cb = data->target_cfg->callbacks->error;
	}
#endif

	if (LL_I2C_IsActiveFlag_ARLO(i2c)) {
		LL_I2C_ClearFlag_ARLO(i2c);
#if defined(CONFIG_I2C_TARGET)
		if (error_cb != NULL) {
			error_cb(data->target_cfg, I2C_ERROR_ARBITRATION);
		}
#endif
		ret = -EIO;
	}

	/* Address "Spurious Bus Error detection in controller mode"
	 * erratum, that affects STM32 I2C v2 controller, referenced
	 * in multiple errata sheets document like:
	 * - ES0392 (STM32H74x/75x), Rev 15, section 2.19.4
	 *
	 * Workaround: clear the BERR flag and let the ongoing
	 * transfer continue. If a real bus error has occurred,
	 * the transfer will eventually time out.
	 */
	if (LL_I2C_IsActiveFlag_BERR(i2c)) {
		LL_I2C_ClearFlag_BERR(i2c);
#if defined(CONFIG_I2C_TARGET)
		if (!data->controller_active) {
			if (error_cb != NULL) {
				error_cb(data->target_cfg, I2C_ERROR_GENERIC);
			}
			ret = -EIO;
		}
#endif
	}

#if defined(CONFIG_I2C_TARGET)
	if (data->target_attached && !data->controller_active) {
		return ret;
	}
#endif

	if (ret) {
		i2c_stm32_controller_mode_end(dev);
		i2c_stm32_rtio_complete(dev, ret);
	}

	return ret;
}

int i2c_stm32_msg_start(const struct device *dev, uint8_t flags, uint8_t *buf, size_t buf_len,
			uint16_t i2c_addr)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	uint32_t transfer;
	bool generate_start = true;

#if defined(CONFIG_I2C_STM32_V2_DMA)
	/* i2c_stm32_xfer_will_use_dma() flushes cache on write message if needed */
	data->use_dma = i2c_stm32_xfer_will_use_dma(cfg, buf, buf_len,
						    (flags & I2C_MSG_RW_MASK) == I2C_MSG_WRITE);
#endif /* CONFIG_I2C_STM32_V2_DMA */

	data->xfer_buf = buf;
	data->xfer_len = buf_len;
	data->xfer_flags = flags;

	if (LL_I2C_IsEnabledReloadMode(i2c)) {
		__ASSERT_NO_MSG((flags & I2C_MSG_RESTART) == 0U);
		i2c_stm32_reload_burst(dev);
		generate_start = false;
		goto out;
	}

	if ((flags & I2C_MSG_READ) != 0) {
		transfer = LL_I2C_REQUEST_READ;
	} else {
		transfer = LL_I2C_REQUEST_WRITE;
	}

	if ((I2C_MSG_ADDR_10_BITS & flags) != 0) {
		LL_I2C_SetMasterAddressingMode(i2c,
				LL_I2C_ADDRESSING_MODE_10BIT);
		LL_I2C_SetSlaveAddr(i2c, (uint32_t) i2c_addr);
	} else {
		LL_I2C_SetMasterAddressingMode(i2c,
			LL_I2C_ADDRESSING_MODE_7BIT);
		LL_I2C_SetSlaveAddr(i2c, (uint32_t) i2c_addr << 1);
	}

	if (buf_len > UINT8_MAX) {
		data->burst_flags = flags & ~I2C_MSG_STOP;
		data->burst_len = UINT8_MAX;
		LL_I2C_EnableReloadMode(i2c);
	} else {
		data->burst_flags = flags;
		data->burst_len = buf_len;
		if ((flags & I2C_MSG_STM32_USE_RELOAD_MODE) != 0) {
			LL_I2C_EnableReloadMode(i2c);
		} else {
			LL_I2C_DisableReloadMode(i2c);
		}
	}

	LL_I2C_DisableAutoEndMode(i2c);
	LL_I2C_SetTransferRequest(i2c, transfer);
	LL_I2C_SetTransferSize(i2c, data->burst_len);

#if defined(CONFIG_I2C_TARGET)
	data->controller_active = true;
#endif

	LL_I2C_Enable(i2c);

out:
	if (using_dma(data) && dma_xfer_start(dev) != 0) {
		i2c_stm32_controller_mode_end(dev);
		return -EIO;
	}

	i2c_stm32_enable_transfer_interrupts(dev);

	if (!using_dma(data)) {
		if ((flags & I2C_MSG_READ) != 0) {
			LL_I2C_EnableIT_RX(i2c);
		} else {
			LL_I2C_EnableIT_TX(i2c);
		}
	}

	if (generate_start) {
		LL_I2C_GenerateStartCondition(i2c);
	}

	return 0;
}

int i2c_stm32_configure_timing(const struct device *dev, uint32_t clock)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	uint32_t i2c_hold_time_min, i2c_setup_time_min;
	uint32_t i2c_h_min_time, i2c_l_min_time;
	uint32_t presc = 1U;
	uint32_t timing = 0U;

	/* Look for an adequate preset timing value */
	for (uint32_t i = 0; i < cfg->n_timings; i++) {
		const struct i2c_config_timing *preset = &cfg->timings[i];
		uint32_t speed = i2c_map_dt_bitrate(preset->i2c_speed);

		if ((I2C_SPEED_GET(speed) == I2C_SPEED_GET(data->dev_config)) &&
		    (preset->periph_clock == clock)) {
			/*  Found a matching periph clock and i2c speed */
			LL_I2C_SetTiming(i2c, preset->timing_setting);
			return 0;
		}
	}

	/* No preset timing was provided, let's dynamically configure */
	switch (I2C_SPEED_GET(data->dev_config)) {
	case I2C_SPEED_STANDARD:
		i2c_h_min_time = 4000U;
		i2c_l_min_time = 4700U;
		i2c_hold_time_min = 500U;
		i2c_setup_time_min = 1250U;
		break;
	case I2C_SPEED_FAST:
		i2c_h_min_time = 600U;
		i2c_l_min_time = 1300U;
		i2c_hold_time_min = 375U;
		i2c_setup_time_min = 500U;
		break;
	default:
		LOG_ERR("i2c: speed above \"fast\" requires manual timing configuration, "
			"see \"timings\" property of st,stm32-i2c-v2 devicetree binding");
		return -EINVAL;
	}

	/* Calculate period until prescaler matches */
	do {
		uint32_t t_presc = clock / presc;
		uint32_t ns_presc = NSEC_PER_SEC / t_presc;
		uint32_t sclh = i2c_h_min_time / ns_presc;
		uint32_t scll = i2c_l_min_time / ns_presc;
		uint32_t sdadel = i2c_hold_time_min / ns_presc;
		uint32_t scldel = i2c_setup_time_min / ns_presc;

		if ((sclh - 1) > 255 || (scll - 1) > 255) {
			++presc;
			continue;
		}

		if (sdadel > 15 || (scldel - 1) > 15) {
			++presc;
			continue;
		}

		timing = STM32_I2C_CONVERT_TIMINGS(presc - 1,
						   scldel - 1, sdadel, sclh - 1, scll - 1);
		break;
	} while (presc < 16);

	if (presc >= 16U) {
		LOG_DBG("I2C:failed to find prescaler value");
		return -EINVAL;
	}

	LL_I2C_SetTiming(i2c, timing);

	return 0;
}
